# Задача 2: Найдите сумму цифр трехзначного числа.
num = input('Введите трехзначное число: ')
print(int(num[0]) + int(num[1]) + int(num[2]))